Статистика работы механизмов/Конфигурация/DataProcessors/_ТестированиеSPPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ТестированиеSPPI</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВыгрузкиВExcel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресаЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерОписанияТабличногоДокумента</Name>
							<Comment>Номер строки ТЧ "ОписанияТабличныхДокументов"</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КритерийТестирования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КритерииТестированияSPPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКритерияТестирования</Name>
							<Comment>Номер строки ТЧ "КритерииТестирования"</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ОтветыТестированияSPPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КритерииТестирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КритерииТестированияSPPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловияДоговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписанияТабличныхДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАктива</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомераДокументов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомераДоговоров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокументов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическихДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочихДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговыхДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеВыпуска</Name>
							<Comment>Для типов: "Облигации"</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаНоминала</Name>
							<Comment>Для типов: "Облигации"</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРегистрации</Name>
							<Comment>Для типов: "Облигации"</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЭмиссии</Name>
							<Comment>Для типов: "Облигации"</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеСтавокКупонов</Name>
							<Comment>Для типов: "Облигации"</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОфертыИлиПогашения</Name>
							<Comment>Для типов: "Облигации"</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодичностьВыплатыКупона</Name>
							<Comment>Для типов: "Облигации", в днях</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодичностьВыплат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПериодичностиВыплатыПроцентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВозвратаДепозитаПоТребованиюКлиента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПодтверждения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГлавныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыВТабличныхДокументах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерОписанияТабличногоДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
								<v8:Type>cfg:DocumentRef.МНО</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ТестированиеSPPI/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресПриЗагрузкеДанныхИзНастроекНаСервере = Неопределено;
	Если Параметры.Свойство("АдресПриЗагрузкеДанныхИзНастроекНаСервере", АдресПриЗагрузкеДанныхИзНастроекНаСервере) Тогда
		ПоместитьВоВременноеХранилище(Истина, АдресПриЗагрузкеДанныхИзНастроекНаСервере);
	КонецЕсли;
	// Подпись на обновление при изменении текущей организации
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	ЭтаФорма.Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ПросматриваемыйТабличныйДокумент, "НеИспользовать");
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	// Счета доверительного управления
	МассивСчетовДоверительногоУправления = Настройки.Получить("МассивСчетовДоверительногоУправления");
	Если МассивСчетовДоверительногоУправления <> Неопределено Тогда
		Для Каждого СчетДоверительногоУправления Из МассивСчетовДоверительногоУправления Цикл
			СтрокаСчетовДоверительногоУправления = Объект.СчетаДоверительногоУправления.Добавить();
			СтрокаСчетовДоверительногоУправления.Ссылка = СчетДоверительногоУправления;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	// Счета доверительного управления
	МассивСчетовДоверительногоУправления = Новый Массив;
	Для Каждого СчетДоверительногоУправления Из Объект.СчетаДоверительногоУправления Цикл
		МассивСчетовДоверительногоУправления.Добавить(СчетДоверительногоУправления.Ссылка);
	КонецЦикла;
	Настройки.Вставить("МассивСчетовДоверительногоУправления", МассивСчетовДоверительногоУправления);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТекущийСчетДоверительногоУправленияПриИзменении(Элемент)
	Элементы.ТекущаяДата.СписокВыбора.Очистить();
	ДоступныеСтрокиОписания = Объект.ОписанияТабличныхДокументов.НайтиСтроки(
		Новый Структура("СчетДоверительногоУправления", ТекущийСчетДоверительногоУправления));
	УникальныеДаты = Новый Соответствие; // Соответствие(Дата, Истина)
	Для Каждого СтрокаОписания Из ДоступныеСтрокиОписания Цикл
		Если УникальныеДаты.Получить(СтрокаОписания.Дата) = Неопределено Тогда
			Элементы.ТекущаяДата.СписокВыбора.Добавить(СтрокаОписания.Дата, Формат(СтрокаОписания.Дата, "ДФ=dd.MM.yyyy"));
			УникальныеДаты.Вставить(СтрокаОписания.Дата, Истина);
		КонецЕсли;
	КонецЦикла;
	Элементы.ТекущаяДата.СписокВыбора.СортироватьПоЗначению();
	Если Элементы.ТекущаяДата.СписокВыбора.НайтиПоЗначению(ТекущаяДата) = Неопределено Тогда
		Если Элементы.ТекущаяДата.СписокВыбора.Количество() > 0 Тогда
			ТекущаяДата = Элементы.ТекущаяДата.СписокВыбора[0].Значение;
		КонецЕсли;
	КонецЕсли;
	// Заполнение списков выбора других измерений происходит в следующем обработчике
	ТекущаяДатаПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяДатаПриИзменении(Элемент)
	Элементы.ТекущийТабличныйДокумент.СписокВыбора.Очистить();
	ДоступныеСтрокиОписания = Объект.ОписанияТабличныхДокументов.НайтиСтроки(
		Новый Структура("СчетДоверительногоУправления, Дата", ТекущийСчетДоверительногоУправления, ТекущаяДата));
	УникальныеТабличныеДокументы = Новый Соответствие; // Соответствие(Строка (Наименование табличного документа), Истина)
	Для Каждого СтрокаОписания Из ДоступныеСтрокиОписания Цикл
		Если УникальныеТабличныеДокументы.Получить(СтрокаОписания.Наименование) = Неопределено Тогда
			Элементы.ТекущийТабличныйДокумент.СписокВыбора.Добавить(СтрокаОписания.Наименование);
			УникальныеТабличныеДокументы.Вставить(СтрокаОписания.Наименование, Истина);
		КонецЕсли;
	КонецЦикла;
	Элементы.ТекущийТабличныйДокумент.СписокВыбора.СортироватьПоЗначению();
	Если Элементы.ТекущийТабличныйДокумент.СписокВыбора.НайтиПоЗначению(ТекущийТабличныйДокумент) = Неопределено Тогда
		Если Элементы.ТекущийТабличныйДокумент.СписокВыбора.Количество() > 0 Тогда
			ТекущийТабличныйДокумент = Элементы.ТекущийТабличныйДокумент.СписокВыбора[0].Значение;
		КонецЕсли;
	КонецЕсли;
	// Заполнение списков выбора других измерений происходит в следующем обработчике
	ТекущийТабличныйДокументПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийТабличныйДокументПриИзменении(Элемент)
	ДоступныеСтрокиОписания = Объект.ОписанияТабличныхДокументов.НайтиСтроки(
		Новый Структура("СчетДоверительногоУправления, Дата, Наименование",
			ТекущийСчетДоверительногоУправления, ТекущаяДата, ТекущийТабличныйДокумент));
	Если ДоступныеСтрокиОписания.Количество() > 1 Тогда
		Сообщить("Неоднозначный выбор табличного документа.");
		Возврат;
	КонецЕсли;
	Если ДоступныеСтрокиОписания.Количество() = 0 Тогда
		Если Объект.ОписанияТабличныхДокументов.Количество() = 0 Тогда
			Сообщить("Нет данных для построения табличных документов.");
		Иначе
			Сообщить("Табличный документ не найден.");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	СтрокаОписания = ДоступныеСтрокиОписания[0];
	ТекущийТипАктива = СтрокаОписания.ТипАктива;
	ТекущийНомерОписанияТабличногоДокумента = СтрокаОписания.НомерСтроки;
	ПостроитьТабличныйДокументНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиВExcelНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог = Объект.ПутьВыгрузкиВExcel;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выберите каталог";
	
	Если Диалог.Выбрать() Тогда
		Объект.ПутьВыгрузкиВExcel = Диалог.Каталог;
	КонецЕсли;
КонецПроцедуры

// Изменение строкового представления табличной части нужно для того, чтобы обработка понимала, что нужно запустить сохранение настроек формы
&НаКлиенте
Процедура СчетаДоверительногоУправленияПриИзменении(Элемент)
	СчетаДоверительногоУправленияСтрокой = "";
	Для Каждого СтрокаСчетовДоверительногоУправления Из Объект.СчетаДоверительногоУправления Цикл
		СчетаДоверительногоУправленияСтрокой = СчетаДоверительногоУправленияСтрокой
			+ СтрокаСчетовДоверительногоУправления.Ссылка + ";";
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Копия процедуры "ВыгрузитьВExcel" модуля объекта на клиенте
&НаКлиенте
Процедура КомандаВыгрузитьВExcel(Команда)
	Если ПустаяСтрока(СтрЗаменить(СтрЗаменить(СокрЛП(Объект.ПутьВыгрузкиВExcel), "/", ""), "\", "")) Тогда
		Сообщить("Путь выгрузки пуст.");
		Возврат;
	КонецЕсли;
	
	ПакетОтображаемыхДокументов = Новый ПакетОтображаемыхДокументов;
	ТекущийСчетДоверительногоУправления = Неопределено;
	ТекущаяДата = Неопределено;
	// Оформление пути
	Объект.ПутьВыгрузкиВExcel = СокрЛП(Объект.ПутьВыгрузкиВExcel);
	Если Прав(Объект.ПутьВыгрузкиВExcel, 1) <> "\" И Прав(Объект.ПутьВыгрузкиВExcel, 1) <> "/" Тогда
		Объект.ПутьВыгрузкиВExcel = Объект.ПутьВыгрузкиВExcel + "\";
	КонецЕсли;
	СозданоФайлов = 0;
	ИмяПодпапкиВыгрузкиВExcel = "Тестирование SPPI от " + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd");
	ПутьПодпапкиВыгрузкиВExcel = Объект.ПутьВыгрузкиВExcel + ИмяПодпапкиВыгрузкиВExcel;
	СуществующаяДиректория = Новый Файл(ПутьПодпапкиВыгрузкиВExcel);
	Если Не СуществующаяДиректория.Существует() Тогда
		Попытка
			СоздатьКаталог(СуществующаяДиректория.ПолноеИмя);
		Исключение
			Сообщить("Не удалось создать директорию """ + СуществующаяДиректория.ПолноеИмя + """.");
			Возврат;
		КонецПопытки;
	КонецЕсли;
	УникальныйИдентификаторФайлов = Новый УникальныйИдентификатор;
	ТабличныеДокументы = ПолучитьТабличныеДокументы();
	РаспределениеТабличныхДокументов = Новый СписокЗначений; // СписокЗначений(СписокЗначений
	Для Каждого СтрокаТабличныхДокументов Из ТабличныеДокументы Цикл
		// При изменении измерений нужно сохранить файл
		Если ТекущийСчетДоверительногоУправления <> СтрокаТабличныхДокументов.Информация.СчетДоверительногоУправления
			Или ТекущаяДата <> СтрокаТабличныхДокументов.Информация.Дата
		Тогда
			Если ПакетОтображаемыхДокументов.Состав.Количество() > 0 Тогда
				МожноСоздатьФайл = Истина;
				ТекущийСчетДоверительногоУправленияСтрокой =
					СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(ТекущийСчетДоверительногоУправления), "/", ""), "\", ""), """", "");
				ПолныйПутьДоФайла = ПутьПодпапкиВыгрузкиВExcel + "\" + "[" + Формат(ТекущаяДата, "ДФ=yyyy-MM-dd") + "], "
					+ ТекущийСчетДоверительногоУправленияСтрокой + " - Тестирование SPPI.xlsx";
				СуществующийФайл = Новый Файл(ПолныйПутьДоФайла);
				Если СуществующийФайл.Существует() Тогда
					Попытка
						УдалитьФайлы(СуществующийФайл.ПолноеИмя);
					Исключение
						Сообщить("Не удалось удалить существующий файл """ + СуществующийФайл.ПолноеИмя + """.");
						МожноСоздатьФайл = Ложь;
					КонецПопытки;
				КонецЕсли;
				Если МожноСоздатьФайл Тогда
					ПакетОтображаемыхДокументов.Записать(ПолныйПутьДоФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
					СозданоФайлов = СозданоФайлов + 1;
				КонецЕсли;
				ПакетОтображаемыхДокументов.Состав.Очистить();
			КонецЕсли;
			ТекущийСчетДоверительногоУправления = СтрокаТабличныхДокументов.Информация.СчетДоверительногоУправления;
			ТекущаяДата = СтрокаТабличныхДокументов.Информация.Дата;
		КонецЕсли;
		// Заполнение текущего файла
		АдресРезультата = ПоместитьВоВременноеХранилище(СтрокаТабличныхДокументов.ТабличныйДокумент, УникальныйИдентификаторФайлов);
		ЭлементПакета = ПакетОтображаемыхДокументов.Состав.Добавить(АдресРезультата);
		ЭлементПакета.Наименование = СтрокаТабличныхДокументов.Информация.Наименование;
	КонецЦикла;
	// После завершения цикла нужно сохранить последний файл
	Если ПакетОтображаемыхДокументов.Состав.Количество() > 0 Тогда
		МожноСоздатьФайл = Истина;
		ТекущийСчетДоверительногоУправленияСтрокой =
			СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(ТекущийСчетДоверительногоУправления), "/", ""), "\", ""), """", "");
		ПолныйПутьДоФайла = ПутьПодпапкиВыгрузкиВExcel + "\" + "[" + Формат(ТекущаяДата, "ДФ=yyyy-MM-dd") + "], "
			+ ТекущийСчетДоверительногоУправленияСтрокой + " - Тестирование SPPI.xlsx";
		СуществующийФайл = Новый Файл(ПолныйПутьДоФайла);
		Если СуществующийФайл.Существует() Тогда
			Попытка
				УдалитьФайлы(СуществующийФайл.ПолноеИмя);
			Исключение
				Сообщить("Не удалось удалить существующий файл """ + СуществующийФайл.ПолноеИмя + """.");
				МожноСоздатьФайл = Ложь;
			КонецПопытки;
		КонецЕсли;
		Если МожноСоздатьФайл Тогда
			ПакетОтображаемыхДокументов.Записать(ПолныйПутьДоФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
			СозданоФайлов = СозданоФайлов + 1;
		КонецЕсли;
		ПакетОтображаемыхДокументов.Состав.Очистить();
	КонецЕсли;
	Если СозданоФайлов > 0 Тогда
		Сообщить("Создание файлов (" + СозданоФайлов + ") завершено успешно.");
	Иначе
		Сообщить("Не было создано ни одного файла.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	КомандаСформироватьНаСервере();
	ПриПолученииДанныхОЦенныхБумагах();
КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьНаСервере()
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.СформироватьДанныеОЦенныхБумагах();
	ЗначениеВРеквизитФормы(ОбъектЗначение, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура КомандаРедактироватьОтветы(Команда)
	ПараметрыФормы = Новый Структура;
	// Параметр "Организация"
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	// Параметр "СчетДоверительногоУправления"
	Если Не ЗначениеЗаполнено(ТекущийСчетДоверительногоУправления) Тогда
		ПоказатьПредупреждение(, "Не выбран счёт Д/У.",, "Ошибка редактирования ответов");
		Возврат;
	КонецЕсли;
	ПараметрыФормы.Вставить("СчетДоверительногоУправления", ТекущийСчетДоверительногоУправления);
	// Параметр "Дата"
	Если Не ЗначениеЗаполнено(ТекущийСчетДоверительногоУправления) Тогда
		ПоказатьПредупреждение(, "Не выбрана дата.",, "Ошибка редактирования ответов");
		Возврат;
	КонецЕсли;
	ПараметрыФормы.Вставить("Дата", ТекущаяДата);
	// Параметр "МассивОбъектов"
	МассивОбъектов = Новый Массив;
	Для Каждого НайденнаяСтрока Из Объект.ОбъектыВТабличныхДокументах.НайтиСтроки(
		Новый Структура("НомерОписанияТабличногоДокумента", ТекущийНомерОписанияТабличногоДокумента))
	Цикл
		МассивОбъектов.Добавить(НайденнаяСтрока.Объект);
	КонецЦикла;
	ПараметрыФормы.Вставить("МассивОбъектов", МассивОбъектов);
	// Параметр "КоллекцияОтветов"
	Если Не ЗначениеЗаполнено(ТекущийНомерОписанияТабличногоДокумента) Тогда
		ПоказатьПредупреждение(, "Не выбран табличный документ.",, "Ошибка редактирования ответов");
		Возврат;
	КонецЕсли;
	МассивОтветов = Новый Массив;
	ПараметрыФормы.Вставить("КоллекцияОтветов", МассивОтветов);
	ОбновляемыеНастройкиОтветов = Объект.НастройкиОтветов.НайтиСтроки(
		Новый Структура("НомерОписанияТабличногоДокумента", ТекущийНомерОписанияТабличногоДокумента));
	Для Каждого СтрокаНастройкиОтветов Из ОбновляемыеНастройкиОтветов Цикл
		ТекущийОтвет = Объект.КритерииТестирования[СтрокаНастройкиОтветов.НомерКритерияТестирования -1];
		НовыйЭлементМассива = Новый Структура("Порядок, КритерийТестирования, НомерКритерияТестирования, УсловияДоговора, Описание, Ответ");
		ЗаполнитьЗначенияСвойств(НовыйЭлементМассива, СтрокаНастройкиОтветов);
		НовыйЭлементМассива.УсловияДоговора = ТекущийОтвет.УсловияДоговора;
		НовыйЭлементМассива.Описание = ТекущийОтвет.Описание;
		МассивОтветов.Добавить(НовыйЭлементМассива);
	КонецЦикла;
	// Параметр "НаименованиеТабличногоДокумента"
	ПараметрыФормы.Вставить("НаименованиеТабличногоДокумента",
		Объект.ОписанияТабличныхДокументов[ТекущийНомерОписанияТабличногоДокумента - 1].Наименование);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияОтветов", ЭтотОбъект);
	ОткрытьФорму("ВнешняяОбработка._ТестированиеSPPI.Форма.ФормаРедактированияОтветов", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещенияОЗакрытии);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьПрошлыйРабочийДень(Команда)
	КомандаУстановитьПрошлыйРабочийДеньНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаУстановитьПрошлыйРабочийДеньНаСервере()
	ПрошлыйРабочийДень = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата(), -2);
	Объект.Период = Новый СтандартныйПериод(ПрошлыйРабочийДень, НачалоДня(НачалоДня(ТекущаяДата()) - 1));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы["Результат"], "НЕАКТУАЛЬНОСТЬ");
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияОтветов(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатЗакрытия) = Тип("Массив") Тогда
		ОбновляемыеНастройкиОтветов = Объект.НастройкиОтветов.НайтиСтроки(
			Новый Структура("НомерОписанияТабличногоДокумента", ТекущийНомерОписанияТабличногоДокумента));
		Для Каждого СтрокаНастроевОтветов Из ОбновляемыеНастройкиОтветов Цикл
			Объект.НастройкиОтветов.Удалить(СтрокаНастроевОтветов);
		КонецЦикла;
		Для Каждого ДанныеНовойНастройкиОтветов Из РезультатЗакрытия Цикл
			СтрокаНастройкиОтветов = Объект.НастройкиОтветов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНастройкиОтветов, ДанныеНовойНастройкиОтветов);
			СтрокаНастройкиОтветов.НомерОписанияТабличногоДокумента = ТекущийНомерОписанияТабличногоДокумента;
		КонецЦикла;
		ПостроитьТабличныйДокументНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриПолученииДанныхОЦенныхБумагах()
	Элементы.ТекущийСчетДоверительногоУправления.СписокВыбора.Очистить();
	УникальныеСчетаДоверительногоУправления = Новый Соответствие; // Соответствие(СправочникСсылка.СчетаДоверительногоУправления, Истина)
	Для Каждого СтрокаОписания Из Объект.ОписанияТабличныхДокументов Цикл
		Если УникальныеСчетаДоверительногоУправления.Получить(СтрокаОписания.СчетДоверительногоУправления) = Неопределено Тогда
			Элементы.ТекущийСчетДоверительногоУправления.СписокВыбора.Добавить(СтрокаОписания.СчетДоверительногоУправления);
			УникальныеСчетаДоверительногоУправления.Вставить(СтрокаОписания.СчетДоверительногоУправления, Истина);
		КонецЕсли;
	КонецЦикла;
	Элементы.ТекущийСчетДоверительногоУправления.СписокВыбора.СортироватьПоЗначению();
	Если Элементы.ТекущийСчетДоверительногоУправления.СписокВыбора.НайтиПоЗначению(ТекущийСчетДоверительногоУправления) = Неопределено Тогда
		Если Элементы.ТекущийСчетДоверительногоУправления.СписокВыбора.Количество() > 0 Тогда
			ТекущийСчетДоверительногоУправления = Элементы.ТекущийСчетДоверительногоУправления.СписокВыбора[0].Значение;
		КонецЕсли;
	КонецЕсли;
	// Заполнение списков выбора других измерений происходит в следующем обработчике
	ТекущийСчетДоверительногоУправленияПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПостроитьТабличныйДокументНаСервере()
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = ОбъектЗначение.ПостроитьТабличныйДокумент(
		ТекущийСчетДоверительногоУправления, ТекущаяДата, ТекущийТипАктива, ТекущийТабличныйДокумент);
	ПросматриваемыйТабличныйДокумент.Очистить();
	Если ТабличныйДокумент <> Неопределено Тогда
		ПросматриваемыйТабличныйДокумент.Вывести(ТабличныйДокумент);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныеДокументы()
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектЗначение.ПолучитьТабличныеДокументы();
КонецФункции

#КонецОбласти
